html/JavaWeb/java_web_kehouti.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>课本上的课后题</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">课本上的课后题</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb93f43b">1. 选择题</a>
<ul>
<li><a href="#orgddfbd81">1.1. 第一章 (P19)</a></li>
<li><a href="#org01aea12">1.2. 第二章 (P48)</a></li>
<li><a href="#org673a26c">1.3. 第三章 (P67)</a></li>
<li><a href="#org5ee5eef">1.4. 第四章 (P86)</a></li>
<li><a href="#org0d04ec8">1.5. 第五章 (P107)</a></li>
<li><a href="#org8c6230a">1.6. 第六章 (P125)</a></li>
<li><a href="#org3735571">1.7. 第七章 (P146)</a></li>
<li><a href="#org6c45884">1.8. 第八章 (P165)</a></li>
<li><a href="#org4637c7b">1.9. 第九章 (P180)</a></li>
<li><a href="#org12eb586">1.10. 第十章 (P206)</a></li>
<li><a href="#org2fe694f">1.11. 第 11 章 (P221)</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-orgb93f43b" class="outline-2">
<h2 id="orgb93f43b"><span class="section-number-2">1</span> 选择题</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgddfbd81" class="outline-3">
<h3 id="orgddfbd81"><span class="section-number-3">1.1</span> 第一章 (P19)</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>B
<ul class="org-ul">
<li>src Java 源代码</li>
<li>根目录指定就是 WebContent 文件夹</li>
<li>WebContent/WEB-INF 私密</li>
</ul></li>

<li>B</li>

<li>A
<ul class="org-ul">
<li>404，资源未找到，url 错了</li>
<li>服务器未启动: 无法访问此网站</li>
<li>50x，服务器出现异常</li>
</ul></li>

<li>ABC
<ul class="org-ul">
<li>看清题目: 是不正确的是</li>
</ul></li>

<li>BCD
<ul class="org-ul">
<li>网络协议: 为进行网络中数据交换而建立的规则、标准或约定</li>
<li>HTTP 是 WWW 中应用最广泛的</li>
<li>HTML 是 用来设计网站的 Markup 语言</li>
</ul></li>

<li>C
<ul class="org-ul">
<li><a href="http://localhost:9999/book/list">http://localhost:9999/book/list</a></li>
<li>协议://主机:端口/上下文路径/地址</li>
</ul></li>

<li>D
<ul class="org-ul">
<li>虚拟目录，就是所谓的上下文路径</li>
</ul></li>

<li>AB
<ul class="org-ul">
<li>Java Web 项目的核心配置文件是 web.xml</li>
<li>从 Servlet3.x 这个文件可以不要，而使用注解替代</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org01aea12" class="outline-3">
<h3 id="org01aea12"><span class="section-number-3">1.2</span> 第二章 (P48)</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>D
<ul class="org-ul">
<li>协议://主机:端口/上下文路径(项目名)/地址(url-pattern)</li>
<li><a href="http://localhost:8080/helloapp/hello">http://localhost:8080/helloapp/hello</a></li>
</ul></li>

<li>C
<ul class="org-ul">
<li>一个 Servlet 只会存在一个 (创建一次、销毁一次)</li>
<li>service 方法会在每次请求来的时候被调用一次</li>
</ul></li>

<li>B</li>

<li>A
<ul class="org-ul">
<li>req.getParameter() 接受来自客户端的请求数据</li>
<li>req.getAttribute() 拿取通过 req.setAttribute 放进去的数据</li>
</ul></li>

<li>AC ?
<ul class="org-ul">
<li>getOutputStream() 更原始的一种输入输出，默认不会对编码进行干预</li>
<li>getWriter() 自动根据你设置的 response.setCharacterEncoding("utf-8") 进行自动转码</li>
</ul></li>

<li><p>
C
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #687080; font-style: italic;">// </span><span style="color: #687080; font-style: italic;">&#26381;&#21153;&#22120;&#20869;&#37096;&#30340;: &#36716;&#21457;</span>
req.getRequestDispatcher<span style="color: #8c8c8c;">(</span><span style="color: #98be65;">"/list"</span><span style="color: #8c8c8c;">)</span>.forward<span style="color: #8c8c8c;">(</span>req, resp<span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">// </span><span style="color: #687080; font-style: italic;">&#23436;&#25104;&#20102;&#25972;&#20010;&#35831;&#27714;&#21644;&#21709;&#24212;: &#37325;&#23450;&#21521;</span>
resp.sendRedirect<span style="color: #8c8c8c;">(</span><span style="color: #98be65;">"/phone/list"</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div></li>

<li>D
<ul class="org-ul">
<li>获取一个值 String xx = req.getParameter(xx)</li>
<li>获取多个值 String[] xxs = req.getParameterValues(xx)</li>
<li><p>
取多个的示例:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #687080; font-style: italic;">// </span><span style="color: #687080; font-style: italic;">&lt;input type="checkbox" name='color' value='red'&gt;&#32418;&#33394;</span>
<span style="color: #687080; font-style: italic;">// </span><span style="color: #687080; font-style: italic;">&lt;input type="checkbox" name='color' value='green'&gt;&#32511;&#33394;</span>
<span style="color: #687080; font-style: italic;">// </span><span style="color: #687080; font-style: italic;">&lt;input type="checkbox" name='color' value='purple'&gt;&#32043;&#33394;</span>
<span style="color: #61afef;">String</span><span style="color: #8c8c8c;">[]</span> <span style="color: #61afef;">colors</span> = req.getParameterValues<span style="color: #8c8c8c;">(</span><span style="color: #98be65;">"color"</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #8c8c8c;">(</span><span style="color: #61afef;">String</span> <span style="color: #61afef;">color</span> : colors<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
    System.out.println<span style="color: #93a8c6;">(</span>color<span style="color: #93a8c6;">)</span>;
<span style="color: #8c8c8c;">}</span>
</pre>
</div></li>
</ul></li>

<li>A
<ul class="org-ul">
<li>request != requert 拼写错误</li>
</ul></li>

<li>C
<ul class="org-ul">
<li>也可以覆盖 doGet/doPost 方法</li>
<li>如果覆盖了 service 方法，那么 doGet/doPost 则会无效</li>
</ul></li>

<li>B
<ul class="org-ul">
<li>WebContent
<ul class="org-ul">
<li>静态文件</li>
<li>静态文件夹/**</li>
<li>WEB-INF
<ul class="org-ul">
<li>web.xml</li>
<li>lib/xx.jar</li>
<li>classes/*.class</li>
</ul></li>
</ul></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org673a26c" class="outline-3">
<h3 id="org673a26c"><span class="section-number-3">1.3</span> 第三章 (P67)</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>AC
<ul class="org-ul">
<li>过滤器必须实现 Filter 接口</li>
<li>必须要重写 doFilter/init/destroy 方法</li>
<li>chain.doFilter 来执行下一个的 Filter 或 Servlet</li>
</ul></li>

<li>BC</li>

<li>A
<ul class="org-ul">
<li>必须的是 filter-name</li>
<li>另一个是 servlet-name 或者 url-pattern</li>
</ul></li>

<li>C</li>

<li>ABC
<ul class="org-ul">
<li>单例模式</li>
</ul></li>

<li>AC
<ul class="org-ul">
<li>只有一个</li>
<li>可以放共享的数据</li>
<li>servletContext.setAttribute("xxx", xx);</li>
</ul></li>

<li><p>
BD
配置:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #61afef;">web-app</span> <span style="color: #61afef;">version</span>=<span style="color: #98be65;">"3.1"</span> <span style="color: #61afef;">xmlns</span>=<span style="color: #98be65;">"http://xmlns.jcp.org/xml/ns/javaee"</span> <span style="color: #61afef; font-weight: bold;">xmlns</span>:<span style="color: #61afef;">xsi</span>=<span style="color: #98be65;">"http://www.w3.org/2001/XMLSchema-instance"</span> <span style="color: #61afef; font-weight: bold;">xsi</span>:<span style="color: #61afef;">schemaLocation</span>=<span style="color: #98be65;">"http://xmlns.jcp.org/xml/ns/javaee                       http://xmlns.jcp.org/xml/ns/javaee/web-app_3_1.xsd"</span>&gt;
    &lt;<span style="color: #61afef;">context-param</span>&gt;
        &lt;<span style="color: #61afef;">param-name</span>&gt;bj&lt;/<span style="color: #61afef;">param-name</span>&gt;
        &lt;<span style="color: #61afef;">param-value</span>&gt;yaoliusan&lt;/<span style="color: #61afef;">param-value</span>&gt;
    &lt;/<span style="color: #61afef;">context-param</span>&gt;
&lt;/<span style="color: #61afef;">web-app</span>&gt;
</pre>
</div>

<p>
获取:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #61afef;">String</span> <span style="color: #61afef;">banjiString</span> = getServletContext<span style="color: #8c8c8c;">()</span>.getInitParameter<span style="color: #8c8c8c;">(</span><span style="color: #98be65;">"bj"</span><span style="color: #8c8c8c;">)</span>;
req.setAttribute<span style="color: #8c8c8c;">(</span><span style="color: #98be65;">"banji"</span>, banjiString<span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
使用:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">h3</span><span style="color: #8c8c8c;">&gt;</span><span style="font-style: italic; text-decoration: underline;">$</span><span style="color: #8c8c8c; font-style: italic; text-decoration: underline;">{</span><span style="font-style: italic; text-decoration: underline;">banji</span><span style="color: #8c8c8c; font-style: italic; text-decoration: underline;">}</span><span style="font-style: italic; text-decoration: underline;"> &#30340;&#25163;&#26426;&#31995;&#32479;</span><span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">h3</span><span style="color: #8c8c8c;">&gt;</span>
</pre>
</div></li>

<li>BD
<ul class="org-ul">
<li>可以设置多个 Listener，多多益善</li>
<li>ServletContextListener 可以监听启动或关闭</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org5ee5eef" class="outline-3">
<h3 id="org5ee5eef"><span class="section-number-3">1.4</span> 第四章 (P86)</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>B</li>

<li>AC
<ul class="org-ul">
<li>谷歌浏览器，多个窗口是 Session 共享的。在一些古老的浏览器中，不一定</li>
<li>不同的浏览器，Session 是不通用的，不共享的</li>
</ul></li>

<li>B
<ul class="org-ul">
<li>至少有两个错误</li>
<li>session.getAttriubute 返回的是 Object 类型，一般需要类型转换</li>
<li>out.println，只能有一个参数</li>
</ul></li>

<li>AD</li>

<li>A
<ul class="org-ul">
<li>req.getSession();  如果 session 不存在，那么自动创建</li>
<li>req.getSession(false); 如果 session 不存在，那不会自动创建而且返回 null</li>
</ul></li>

<li>B</li>

<li>C</li>

<li>C</li>

<li>E</li>

<li>B</li>
</ol>
</div>
</div>

<div id="outline-container-org0d04ec8" class="outline-3">
<h3 id="org0d04ec8"><span class="section-number-3">1.5</span> 第五章 (P107)</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>B</li>

<li>D</li>

<li>D</li>

<li>E</li>

<li>ABCD</li>

<li>A</li>

<li>A</li>

<li>E?</li>

<li>ABCE</li>

<li>A</li>
</ol>
</div>
</div>

<div id="outline-container-org8c6230a" class="outline-3">
<h3 id="org8c6230a"><span class="section-number-3">1.6</span> 第六章 (P125)</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>B</li>

<li>A</li>

<li>A</li>

<li>C</li>

<li>D
<ul class="org-ul">
<li>out.println("&lt;!-xxx&#x2026;");</li>
</ul></li>

<li>C</li>

<li>D</li>

<li>D</li>

<li>AD
<ul class="org-ul">
<li>&lt;%= 的话里面的表达式不能有 ; 结尾</li>
</ul></li>

<li>A</li>
</ol>
</div>
</div>

<div id="outline-container-org3735571" class="outline-3">
<h3 id="org3735571"><span class="section-number-3">1.7</span> 第七章 (P146)</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>A</li>

<li>AB</li>

<li>C</li>

<li>A</li>

<li>C</li>

<li>B</li>

<li>D</li>

<li>ABC</li>

<li>?题目错误? BCD
<ul class="org-ul">
<li>A 是错误的, pageContext.getServletContext 来获取 appliction</li>
<li>B/C/D 貌似都是对的</li>
</ul></li>

<li>B</li>
</ol>
</div>
</div>

<div id="outline-container-org6c45884" class="outline-3">
<h3 id="org6c45884"><span class="section-number-3">1.8</span> 第八章 (P165)</h3>
<div class="outline-text-3" id="text-1-8">
<ol class="org-ol">
<li>B</li>

<li>C
<ul class="org-ul">
<li>page</li>
<li>request</li>
<li>session</li>
<li>application 整个应用</li>
</ul></li>

<li>D</li>

<li>CD</li>

<li>C</li>

<li>A</li>

<li>AC</li>

<li>B</li>

<li>D</li>

<li>ACD?</li>
</ol>
</div>
</div>

<div id="outline-container-org4637c7b" class="outline-3">
<h3 id="org4637c7b"><span class="section-number-3">1.9</span> 第九章 (P180)</h3>
<div class="outline-text-3" id="text-1-9">
<ol class="org-ol">
<li>AC</li>

<li>C
<ul class="org-ul">
<li>ne: not equal，不相等</li>
</ul></li>

<li>A</li>

<li>D</li>

<li>A
<ul class="org-ul">
<li>${out.xxx} 不对的</li>
<li>${header["user-agent"]}</li>
</ul></li>

<li>A</li>

<li>ACD?</li>

<li>D</li>

<li>B</li>

<li>C</li>
</ol>
</div>
</div>

<div id="outline-container-org12eb586" class="outline-3">
<h3 id="org12eb586"><span class="section-number-3">1.10</span> 第十章 (P206)</h3>
<div class="outline-text-3" id="text-1-10">
<ol class="org-ol">
<li>B
<ul class="org-ul">
<li>c:if 判断</li>
<li>c:forEach 循环</li>
<li>c:choose/c:forTokens</li>
</ul></li>

<li>B</li>

<li>B</li>

<li>ABCD?</li>

<li>A</li>

<li>D</li>

<li>A</li>

<li>A</li>

<li>C</li>
</ol>
</div>
</div>

<div id="outline-container-org2fe694f" class="outline-3">
<h3 id="org2fe694f"><span class="section-number-3">1.11</span> 第 11 章 (P221)</h3>
<div class="outline-text-3" id="text-1-11">
<ol class="org-ol">
<li>ABC
<ul class="org-ul">
<li>Model, 模型层 (bean/dao) 主要用来处理逻辑</li>
<li>View, 视图层 (jsp) 主要用来渲染页面</li>
<li>Controller, 控制层 (Servlet) 用来居中调停</li>
<li>以上，就是所谓的 MVC 模式</li>
</ul></li>

<li>BCD</li>

<li>B</li>

<li>BC</li>

<li>C</li>

<li>B</li>

<li>C</li>

<li>C</li>
</ol>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-01-22</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
